app/controllers/home_controller.rb

  def flight_query
    if params[:flight]
      params[:flight][:airport_code_from] = params[:flight][:airport_code_from1]
      params[:flight][:airport_code_to] = params[:flight][:airport_code_to1]
      if params[:flight][:flight_date].to_s!=""
        @flights = Flight.find(:all, :conditions => ["unix_timestamp(flight_date)+86400>=unix_timestamp(now()) and (date(flight_date)=? or ?='') and (airport_code_from like ? or ?='') and (airport_code_to like ? or ?='') and (airline like ? or ?='') and (flight_name like ? or ?='')",Date.parse(params[:flight][:flight_date]),Date.parse(params[:flight][:flight_date]),params[:flight][:airport_code_from]+'%',params[:flight][:airport_code_from],params[:flight][:airport_code_to]+'%',params[:flight][:airport_code_to],'%'+params[:flight][:airline]+'%',params[:flight][:airline],'%'+params[:flight][:flight_name]+'%',params[:flight][:flight_name]], :include => [:tickets])
---
SELECT * FROM "flights" WHERE ("flights"."flight_date" = '2009-10-10 21:18:00' AND "flights"."flight_name" = 'CO100') LIMIT 1