app/controllers/message_controller.rb

  def new_backend
    user_to_username = params[:message][:user_to_username]
    subject = params[:message][:subject]
    message_body = params[:message][:message]

    user = User.find :first, :conditions => ["username=?", user_to_username]
    unless user
      flash[:error] = "User doesn't exist."
      redirect_to :action => :new
      return
    end

    @message = Message.new(:user_from_id => session[:user_id],
                           :user_to_id => user.id,
                           :subject => subject,
                           :message => message_body)

    if @message.save
---
SELECT * FROM "users" WHERE (username='tim@tim-ryan.com') LIMIT 1
INSERT INTO "messages" ("message", "updated_at", "deleted_by_sender", "user_to_id", "read", "subject", "deleted_by_recipient", "user_from_id", "ticket_id", "created_at") VALUES('asdfadsf', '2009-10-11 10:31:07', 'f', 1, 'f', 'asdfasdf', 'f', 1, NULL, '2009-10-11 10:31:07')

  def read
    @message = Message.find(:first, :conditions => ["id=?", params[:id]])
    unless @message.user_to_id == session[:user_id] or @message.user_from_id == session[:user_id]
      flash[:error] = "This isn't to you."
      redirect_to :action => :inbox
    end
    if @message.user_to_id == session[:user_id]
      @message["to_from"] = "from"
      # FIXME: This ought to be FK'd into a message anyway.
      @message["other_user"] = User.find(:first, :conditions => ["id=?", @message.user_from_id])
---
SELECT * FROM "messages" WHERE (user_to_id=1 and read='f')
SELECT * FROM "users" WHERE (id=1) LIMIT 1

  def inbox
    @raw_messages = Message.find(:all, :order => "created_at DESC", :conditions => ["user_to_id=? or user_from_id=?", session[:user_id], session[:user_id]])

    @messages = Array.new

    for message in @raw_messages
      if message.user_to_id == session[:user_id] and not message.deleted_by_recipient
        message["to_from"] = "from"
        # FIXME: This ought to be FK'd into a message anyway.
        message["other_user"] = User.find(:first, :conditions => ["id=?", message.user_from_id])
---
SELECT * FROM "messages" WHERE (user_to_id=1 or user_from_id=1) ORDER BY created_at DESC
SELECT * FROM "users" WHERE (id=1) LIMIT 1