app/controllers/ticket_controller.rb

  def flight
    if @flight = Flight.find(params[:id])
      if session[:user_id]
        @user = User.find(session[:user_id])
        @ticket = Ticket.find_by_user_id_and_flight_id(session[:user_id], @flight.id)
        @tickets = Ticket.find_all_by_flight_id(@flight.id, :include => [:user])
---
SELECT * FROM "flights" WHERE ("flights"."id" = 1)
SELECT * FROM "users" WHERE ("users"."id" = 1)
SELECT * FROM "tickets" WHERE ("tickets"."user_id" = 1 AND "tickets"."flight_id" = 1) LIMIT 1
SELECT * FROM "tickets" WHERE ("tickets"."flight_id" = 1)

  def add_ticket
    if session[:pending_ticket]
      ticket_flight = session[:pending_ticket][:flight]
      ticket_interests = session[:pending_ticket][:interests]
      ticket_bio = session[:pending_ticket][:bio]
      ticket_seat = session[:pending_ticket][:seat]
    end
    if params[:ticket]
      ticket_flight = params[:id]
      ticket_interests = params[:ticket][:interests]
      ticket_bio = params[:ticket][:bio]
      ticket_seat = params[:ticket][:seat]
    end
    if session[:user_id]
      if flight = Flight.find(ticket_flight)
        user = User.find(session[:user_id])
        if ticket_interests.to_s == ""
          ticket_interests = user.default_interests
        end
        if ticket_bio.to_s == ""
          ticket_bio = user.default_bio
        end
        if not Ticket.find(:first, :conditions => ["user_id=? and flight_id=?", session[:user_id], flight.id])
          ticket = Ticket.new(:user_id => session[:user_id],
                              :flight_id => flight.id,
                              :bio => ticket_bio,
                              :interests => ticket_interests,
                              :seat => ticket_seat)
          ticket.save
---
SELECT * FROM "flights" WHERE ("flights"."id" = 1)
SELECT * FROM "users" WHERE ("users"."id" = 1)
INSERT INTO "tickets" ("updated_at", "flight_id", "seat", "user_id", "bio", "interests", "created_at") VALUES('2009-10-10 21:20:56', 1, NULL, 1, 'I run in circles all the time.', 'soap salesman', '2009-10-10 21:20:56')

  def my_flights
    @user = User.find(session[:user_id])
---
SELECT * FROM "users" WHERE ("users"."id" = 1)